Dlubal.RFEM5.ISurfaceSupport
Interface for working with surface support

Dlubal.RFEM5.ISurfaceSupport.GetData
Gets surface support parameters.
Returns: Surface support parameters.

Dlubal.RFEM5.ISurfaceSupport.SetData(System.UInt32@)
Sets surface support parameters.
Support: Surface support parameters.

Dlubal.RFEM5.ISurfaceSupport.Delete
Deletes surface support.

Dlubal.RFEM5.ISurfaceSupport.GetNonlinearity(System.UInt32)
Gets interface for working with surface support nonlinearity.
Returns: Nonlinearity interface.
Direction: Nonlinearity direction.